app/controllers/school_classes_controller.rb

    def index
        @classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "History"], ["room_number", 202], ["created_at", "2020-08-28 03:17:50.331909"], ["updated_at", "2020-08-28 03:17:50.331909"]]